#include <dlfcn.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <android/log.h>
#include <jni.h>
#include <string>
#include <vector>
#include <typeinfo>
#include <map>
#include <unordered_map>
#include <array>
#include <sstream>

#include "utf8proc.h"

#include "json/value.h"
#include "json/reader.h"

#include "dl_internal.h"
#include "mcpelauncher.h"
#include "modscript.h"
#include "dobby_public.h"
#include "simpleuuid.h"
#include "logutil.h"

#define cppbool bool

#include "modscript_shared.h"

#include "minecraft_colors.h"

#include "mcpe/i18n.h"
#include "mcpe/entitydamagesource.h"
#include "mcpe/mobfactory.h"
#include "mcpe/synchedentitydata.h"
#include "mcpe/mobeffect.h"
#include "mcpe/packetsender.h"
#include "mcpe/servercommandparser.h"
#include "mcpe/attribute.h"
#include "mcpe/weather.h"
#include "mcpe/dimension.h"
#include "mcpe/util.h"
#include "mcpe/itemrenderer.h"
#include "mcpe/mce/textureptr.h"
#include "mcpe/circuit.h"
#include "mcpe/enchant.h"
#include "mcpe/inventory.h"
#include "mcpe/options.h"
#include "mcpe/screenchooser.h"
#include "mcpe/guidata.h"
#include "mcpe/blockgraphics.h"
#include "mcpe/minecraftcommands.h"
#include "mcpe/gameconnectioninfo.h"
#include "mcpe/textureatlas.h"
#include "mcpe/particle.h"

typedef void RakNetInstance;
typedef void Font;

// FIXME 0.11
//#define MINECRAFT_RAKNET_INSTANCE_OFFSET 76
//#define BLOCK_VTABLE_GET_AABB 14
// found in LocalPlayer::displayClientMessage, also before the first call to Gui constructor
//#define MINECRAFT_GUI_OFFSET 252
//#define MOB_TARGET_OFFSET 3156

// found in GameMode::initPlayer
// or look for Abilities::Abilities
#define PLAYER_ABILITIES_OFFSET 3776
// FIXME 0.11
//#define RAKNET_INSTANCE_VTABLE_OFFSET_SEND 15
// MinecraftClient::handleBack
// FIXME 0.14
//#define MINECRAFT_SCREENCHOOSER_OFFSET 252

// found in _Z13registerBlockI5BlockIRA8_KciS3_RK8MaterialEERT_DpOT0_; tile id 4
const size_t kTileSize = 120;
const size_t kLiquidBlockDynamicSize = 120;
const size_t kLiquidBlockStaticSize = 124;
// found in registerBlock
const size_t kBlockItemSize = 108;
// found in _Z12registerItemI4ItemIRA11_KciEERT_DpOT0_
const size_t kItemSize = 108;
// found in ItemEntity::_validateItem
const size_t kItemEntity_itemInstance_offset = 3244;
// found in TextPacket::handle
const size_t kClientNetworkHandler_vtable_offset_handleTextPacket = 17;
// ProjectileComponent::throwableHit
const size_t kProjectileComponent_entity_offset = 16;

static const char* const listOfRenderersToPatchTextures[] = {
"_ZTV11BatRenderer",
"_ZTV11MobRenderer",
"_ZTV11NpcRenderer",
"_ZTV11PigRenderer",
"_ZTV12WolfRenderer",
"_ZTV13BlazeRenderer",
"_ZTV13GhastRenderer",
"_ZTV13HorseRenderer",
"_ZTV13SheepRenderer",
"_ZTV13SlimeRenderer",
"_ZTV13SquidRenderer",
"_ZTV13StrayRenderer",
"_ZTV13WitchRenderer",
"_ZTV14OcelotRenderer",
"_ZTV14RabbitRenderer",
"_ZTV14SpiderRenderer",
"_ZTV15ChickenRenderer",
"_ZTV15CreeperRenderer",
"_ZTV15ShulkerRenderer",
"_ZTV16EnderManRenderer",
"_ZTV16GuardianRenderer",
"_ZTV16SkeletonRenderer",
"_ZTV16VillagerRenderer",
"_ZTV17EndermiteRenderer",
"_ZTV17IronGolemRenderer",
"_ZTV17LavaSlimeRenderer",
"_ZTV17PolarBearRenderer",
"_ZTV17SnowGolemRenderer",
"_ZTV18SilverfishRenderer",
"_ZTV18WitherBossRenderer",
"_ZTV19EnderDragonRenderer",
"_ZTV19HumanoidMobRenderer",
"_ZTV19MushroomCowRenderer",
"_ZTV22VillagerZombieRenderer"
};

#define AXIS_X 0
#define AXIS_Y 1
#define AXIS_Z 2

#define BLOCK_ID (0x10 + 0)
#define BLOCK_DATA (0x10 + 1)
#define BLOCK_SIDE (0x10 + 2)

#define TEXT_BOLD 1

typedef struct {
	//union {
	//	std::map<const int, int> pack;
		char filler[24];
	//}
} ItemPack;

class Recipe {
public:
	void** vtable; //4
	ItemPack itemPack; //4
	static bool isAnyAuxValue(int);
};

class Recipes {
public:
	std::vector<Recipe*> recipes;
};

typedef struct {
	void** vtable;//0
	ItemPack itemPack; //4
	std::vector<ItemInstance> output; //28
	int filler; //48
} ShapelessRecipe; //52 bytes long

typedef struct {
	void** vtable;//0
	ItemPack itemPack; //4
	char filler2[12]; //28
	ItemInstance* output; //40
	int filler; //48
} ShapedRecipe; //52 bytes long

class Packet {
public:
	virtual ~Packet();
};

// fixme 0.15: size?

class TextPacket : public Packet {
public:
	char filler[8-4]; // 4
	int shouldBeOne; // 8
	unsigned char type; //12
	char filler2[16-14]; // 14
	std::string username; // 16
	std::string message; // 20
	//std::vector<std::string> thevector; // 24
	//char filler3[36-28]; // 28
	char filler3[36-24]; // 24
	virtual ~TextPacket() override;
};

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	std::string message; //12
} ChatPacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	int time;
	char started;
} SetTimePacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	RakString* sender; //12
	RakString* message; //16
} MessagePacket;

class BaseMobSpawner {
public:
	int getSpawnTypeId() const;
};

struct bl_vtable_indexes_nextgen_cpp {
	int tile_get_second_part;
	int tile_vtable_size;
	int blockgraphics_vtable_size;
	int blockgraphics_get_carried_texture;
	int tile_get_color;
	int tile_get_color_data;
	int tile_get_visual_shape;
	//int raknet_instance_connect;
	int mobrenderer_get_skin_ptr;
	int tile_on_redstone_update;
	int tile_is_redstone_block;
	int tile_on_loaded;
	int tile_on_place;
	int mob_set_sneaking;
	int blockitem_vtable_size;
	int blockitem_get_level_data_for_aux_value;
	int item_vtable_size;
	int item_get_enchant_slot;
	int item_get_enchant_value;
	int level_set_difficulty;
	int appplatform_get_ui_scaling_rules;
	int appplatform_get_platform_type;
	int appplatform_get_edition;
	int appplatform_use_centered_gui;
//	int appplatform_use_metadata_driven_screens;
//	int entity_hurt;
	int mobrenderer_render;
	int snowball_item_vtable_size;
	int item_use;
