#include <dlfcn.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <android/log.h>
#include <jni.h>
#include <string>
#include <vector>
#include <typeinfo>
#include <map>
#include <unordered_map>
#include <array>
#include <sstream>

#include "utf8proc.h"

#include "json/value.h"
#include "json/reader.h"

#include "dl_internal.h"
#include "mcpelauncher.h"
#include "modscript.h"
#include "dobby_public.h"
#include "simpleuuid.h"
#include "logutil.h"
#include "get_vtable.h"

#define cppbool bool

#include "modscript_shared.h"

#include "minecraft_colors.h"

#include "mcpe/i18n.h"
#include "mcpe/entitydamagesource.h"
#include "mcpe/mobfactory.h"
#include "mcpe/synchedentitydata.h"
#include "mcpe/mobeffect.h"
#include "mcpe/packetsender.h"
#include "mcpe/servercommandparser.h"
#include "mcpe/attribute.h"
#include "mcpe/weather.h"
#include "mcpe/dimension.h"
#include "mcpe/util.h"
#include "mcpe/itemrenderer.h"
#include "mcpe/mce/textureptr.h"
#include "mcpe/circuit.h"
#include "mcpe/enchant.h"
#include "mcpe/inventory.h"
#include "mcpe/options.h"
#include "mcpe/screenchooser.h"
#include "mcpe/guidata.h"
#include "mcpe/blockgraphics.h"
#include "mcpe/minecraftcommands.h"
#include "mcpe/gameconnectioninfo.h"
#include "mcpe/textureatlas.h"
#include "mcpe/particle.h"
#include "mcpe/blocktessellator.h"
#include "mcpe/commandorigin.h"
#include "mcpe/entityrenderdata.h"
#include "mcpe/clientinstancescreenmodel.h"
#include "mcpe/backgroundworker.h"
#include "mcpe/blockpalette.h"
#include "mcpe/blockidtoitemid.h"
#include "mcpe/vanillaitems.h"
#include "mcpe/itemstack.h"
#include "mcpe/itemdescriptor.h"

typedef void RakNetInstance;
typedef void Font;

// FIXME 0.11
//#define MINECRAFT_RAKNET_INSTANCE_OFFSET 76
//#define BLOCK_VTABLE_GET_AABB 14
// found in LocalPlayer::displayClientMessage, also before the first call to Gui constructor
//#define MINECRAFT_GUI_OFFSET 252
//#define MOB_TARGET_OFFSET 3156

// found in Player::Player
// or look for Abilities::Abilities
// or search for Abilities::getBool
// or ClientInputHandler::updatePlayerState
#define PLAYER_ABILITIES_OFFSET 1812
// FIXME 0.11
//#define RAKNET_INSTANCE_VTABLE_OFFSET_SEND 15
// MinecraftClient::handleBack
// FIXME 0.14
//#define MINECRAFT_SCREENCHOOSER_OFFSET 252

// don't forget to change TextPacket below

// found in _Z13registerBlockI5BlockIRA8_KciS3_RK8MaterialEERT_DpOT0_; tile id 4
const size_t kTileSize = sizeof(BlockLegacy);
//const size_t kLiquidBlockDynamicSize = 736;
//const size_t kLiquidBlockStaticSize = 744;
//static_assert(kLiquidBlockDynamicSize >= kTileSize, "kLiquidBlockDynamicSize");
// found in registerBlock
// const size_t kBlockItemSize = 124; FIXME 1.6
// found in _Z12registerItemI4ItemIRA11_KciEERT_DpOT0_
const size_t kItemSize = sizeof(Item);
// static_assert(kBlockItemSize >= kItemSize, "kBlockItemSize");
// found in ItemEntity::_validateItem
const size_t kItemEntity_itemInstance_offset = 1360;
// ChatScreenController::_sendChatMessage
const size_t kClientInstanceScreenModel_offset = 652;

const size_t kItem_vtable_size = 404;
const size_t kSnowballItem_vtable_size = 404;

// todo 1.2.0
static const char* const listOfRenderersToPatchTextures[] = {
#if 0
"_ZTV11MobRenderer",
"_ZTV11NpcRenderer",
"_ZTV13HorseRenderer",
"_ZTV15HorseRendererV2",
"_ZTV16GuardianRenderer",
"_ZTV19EnderDragonRenderer",
"_ZTV19HumanoidMobRenderer",
#endif
};

#define AXIS_X 0
#define AXIS_Y 1
#define AXIS_Z 2

#define BLOCK_ID (0x10 + 0)
#define BLOCK_DATA (0x10 + 1)
#define BLOCK_SIDE (0x10 + 2)

#define TEXT_BOLD 1

typedef struct {
	//union {
	//	std::map<const int, int> pack;
		char filler[24];
	//}
} ItemPack;

class Recipe {
public:
	void** vtable; //4
	ItemPack itemPack; //4
	static bool isAnyAuxValue(ItemDescriptor const&);
};

class ShapelessRecipe {
public:
	void** vtable;//0
	ItemPack itemPack; //4
	std::vector<ItemInstance> output; //28
	int filler; //48
}; //52 bytes long

namespace mce {
class UUID;
};

class ShapedRecipe {
public:
	char filler[80];
	ItemInstance* getResultItem() const;
};
// from CraftingDataEntry::addShapedRecipe
static_assert(sizeof(ShapedRecipe) == 80, "shaped recipe");

class Packet {
public:
	virtual ~Packet();
};

// fixme 0.15: size?

class TextPacket : public Packet {
public:
	char filler[20-4]; // 4
	unsigned char type; // 20
	char filler2[24-21]; // 14
	std::string username; // 24
	std::string message; // 28
	//std::vector<std::string> thevector; // 24
	//char filler3[36-28]; // 28
	//char filler3[36-24]; // 24
	virtual ~TextPacket() override;
};
// TextPacket::createChat:
// TextPacket(1, arg1, arg2, {}, false, arg3, arg4);
// TextPacket::createRaw:
// TextPacket(0, ?, rawMessage, etc)
static_assert(offsetof(TextPacket, type) == 20, "TextPacket type");
static_assert(offsetof(TextPacket, username) == 24, "textpacket username");
static_assert(offsetof(TextPacket, message) == 28, "textpacket message");

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	std::string message; //12
} ChatPacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	int time;
	char started;
} SetTimePacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	RakString* sender; //12
	RakString* message; //16
} MessagePacket;

class BaseMobSpawner {
public:
	ActorDefinitionIdentifier getSpawnTypeId() const;
	void setEntityId(ActorDefinitionIdentifier);
};

struct bl_vtable_indexes_nextgen_cpp {
	int tile_get_second_part;
	//int tile_vtable_size;
	//int blockgraphics_vtable_size;
	//int blockgraphics_get_carried_texture;
	int tile_get_color;
	int tile_get_color_data;
	int tile_get_visual_shape;
	//int raknet_instance_connect;
	int mobrenderer_get_skin_ptr;
	int tile_on_redstone_update;
	//int tile_is_redstone_block;
	int tile_setup_redstone_component;
	int tile_on_place;
	int mob_set_sneaking;
	int blockitem_vtable_size;
	int blockitem_get_level_data_for_aux_value;
	int item_vtable_size;
	int item_get_enchant_slot;
	int item_get_enchant_value;
	int level_set_difficulty;
	int appplatform_get_ui_scaling_rules;
	int appplatform_get_platform_type;
	int appplatform_get_edition;
//	int appplatform_use_centered_gui;
//	int appplatform_use_metadata_driven_screens;
