#include <dlfcn.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <android/log.h>
#include <jni.h>
#include <string>
#include <vector>
#include <typeinfo>
#include <map>
#include <array>

#include "utf8proc.h"

#include "dl_internal.h"
#include "mcpelauncher.h"
#include "modscript.h"
#include "dobby_public.h"
#include "simpleuuid.h"

#define cppbool bool

#include "modscript_shared.h"

#include "modscript_ScriptLevelListener.hpp"

#include "minecraft_colors.h"

#include "mcpe/i18n.h"
#include "mcpe/entitydamagesource.h"
#include "mcpe/mobfactory.h"
#include "mcpe/synchedentitydata.h"
#include "mcpe/mobeffect.h"
#include "mcpe/packetsender.h"

typedef void RakNetInstance;
typedef void Font;

#define RAKNET_INSTANCE_VTABLE_OFFSET_CONNECT 5
// After the call to RakNetInstance::RakNetInstance
// FIXME 0.11
//#define MINECRAFT_RAKNET_INSTANCE_OFFSET 76
// from SignTileEntity::save(CompoundTag*)
#define SIGN_TILE_ENTITY_LINE_OFFSET 96
#define BLOCK_VTABLE_SIZE 0x118
#define BLOCK_VTABLE_GET_TEXTURE_OFFSET 8
#define BLOCK_VTABLE_GET_COLOR 45
//#define BLOCK_VTABLE_GET_AABB 14
// Mob::getTexture
#define MOB_TEXTURE_OFFSET 2996
// found in LocalPlayer::displayClientMessage, also before the first call to Gui constructor
//#define MINECRAFT_GUI_OFFSET 252
//#define MOB_TARGET_OFFSET 3156
// found in both GameRenderer::moveCameraToPlayer and Minecraft::setLevel
#define MINECRAFT_CAMERA_ENTITY_OFFSET 328
// found in ChatScreen::setTextboxText
#define CHATSCREEN_TEXTBOX_TEXT_OFFSET 200

#ifdef __i386
// FIXME 0.11
#define MINECRAFT_TEXTURES_OFFSET 308
#else
// found in StartMenuScreen::render, or search for getTextureData
#define MINECRAFT_TEXTURES_OFFSET 308
#endif

// found way, way inside GameRenderer::updateFreeformPickDirection, around the call to HitResult::HitResult(Entity*)
// (look for the stack allocation, then see where it's copied)
#define MINECRAFT_HIT_RESULT_OFFSET 2680
// found in TouchInputMove::interactWithEntity
#define MINECRAFT_HIT_ENTITY_OFFSET 2712
// found in GameMode::initPlayer
#define PLAYER_ABILITIES_OFFSET 3196
// FIXME 0.11
//#define RAKNET_INSTANCE_VTABLE_OFFSET_SEND 15
#define PLAYER_RENDER_TYPE 21
// MobSpawnerTileEntity constructor 0x60
#define MOB_SPAWNER_OFFSET 96
// MinecraftClient::handleBack
#define MINECRAFT_SCREENCHOOSER_OFFSET 252

// found in Tile::initTiles; tile id 4
const size_t kTileSize = 0x8c;
// found before TileItem::TileItem
const size_t kTileItemSize = 80;
// found in Item::initItems item with id 6
const size_t kItemSize = 72;
// found in Item::initItems item with id 4
const size_t kFoodItemSize = 100;
// found in Entity::spawnAtLocation
const size_t kItemEntitySize = 360;
// found in Entity::spawnAtLocation
const size_t kItemEntity_pickupDelay_offset = 344;
// found in ItemEntity::_validateItem
const size_t kItemEntity_itemInstance_offset = 324;
// found in TextPacket::handle
const int kClientNetworkHandler_vtable_offset_handleTextPacket = 13;

#define AXIS_X 0
#define AXIS_Y 1
#define AXIS_Z 2

#define BLOCK_ID (0x10 + 0)
#define BLOCK_DATA (0x10 + 1)
#define BLOCK_SIDE (0x10 + 2)

#define TEXT_BOLD 1

typedef struct {
	//union {
	//	std::map<const int, int> pack;
		char filler[24];
	//}
} ItemPack;

typedef struct {
	void** vtable; //4
	ItemPack itemPack; //4
} Recipe;

typedef struct {
	std::vector<Recipe*> recipes;
} Recipes;

typedef struct {
	void** vtable;//0
	ItemPack itemPack; //4
	std::vector<ItemInstance> output; //28
	int filler; //48
} ShapelessRecipe; //52 bytes long

typedef struct {
	void** vtable;//0
	ItemPack itemPack; //4
	char filler2[12]; //28
	ItemInstance* output; //40
	int filler; //48
} ShapedRecipe; //52 bytes long

class Packet {
public:
	Packet();
	virtual ~Packet();
};

class TextPacket : public Packet {
public:
	TextPacket() {
	}
	char filler[13-4]; // 4
	unsigned char type; //13
	char filler2[16-14]; // 14
	std::string username; // 16
	std::string message; // 20
	std::vector<std::string> thevector; // 24
	char filler3[36-28]; // 28
	virtual ~TextPacket() override;
};

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	std::string message; //12
} ChatPacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	int time;
	char started;
} SetTimePacket;

typedef struct {
	void** vtable; //0
	void* filler[2]; //4
	RakString* sender; //12
	RakString* message; //16
} MessagePacket;

struct BaseMobSpawner {
};

extern "C" {

static void (*bl_ChatScreen_sendChatMessage_real)(void*);

static void (*bl_Gui_displayClientMessage)(void*, std::string const&);

static void (*bl_Item_Item)(Item*, int);

static void** bl_FoodItem_vtable;
static void** bl_Item_vtable;
static void** bl_Tile_vtable;
static void** bl_TileItem_vtable;
static Tile** bl_Tile_tiles;
static unsigned char* bl_Tile_lightEmission;
static unsigned char* bl_Tile_lightBlock;

static void (*bl_Item_setNameID)(Item*, std::string const&);

static void (*bl_Minecraft_selectLevel)(Minecraft*, std::string const&, std::string const&, void*);

static void (*bl_MinecraftClient_leaveGame)(Minecraft*, bool saveWorld);
static void (*bl_Minecraft_setLeaveGame)(Minecraft*);

static void (*bl_Minecraft_connectToMCOServer)(Minecraft*, std::string const&, std::string const&, unsigned short);

